latex_pgf_tikz.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-05 Sun 16:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LaTeX - Pgf/Tikz</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LaTeX - Pgf/Tikz</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcea7f7f">Introduction</a></li>
<li><a href="#orga8c62fd">Installation</a></li>
<li><a href="#org7b613cc">Usage</a>
<ul>
<li><a href="#orgb33a64a">Setting</a></li>
<li><a href="#org87cd45a">Style</a></li>
<li><a href="#orgaf117cf">Coordinate</a></li>
<li><a href="#org76a9303">List</a></li>
<li><a href="#org5a5f130">Arrow</a></li>
<li><a href="#orgb0a90dc">Draw</a>
<ul>
<li><a href="#org89e9ece">Line</a></li>
<li><a href="#org7117f28">Curve</a></li>
<li><a href="#orgbb6f243">Grid</a></li>
<li><a href="#orgc551880">Arc</a></li>
<li><a href="#org38eeb3e">Rectangle</a></li>
<li><a href="#org7124134">Circle</a></li>
<li><a href="#org5290b11">Ellipse</a></li>
<li><a href="#org3952ee2">Node</a>
<ul>
<li><a href="#org1031507">Connecting nodes with</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org64b5292">Refer to nodes outside current picture</a></li>
<li><a href="#org3a9f2fd">Mix tikz command with LaTeX</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcea7f7f" class="outline-2">
<h2 id="orgcea7f7f">Introduction</h2>
<div class="outline-text-2" id="text-orgcea7f7f">
<p>
<i>Pgf/tikz</i> is an excellent <i>LaTeX</i> package to plot high quality graphs. This post just summaries its basic usages.
</p>
</div>
</div>
<div id="outline-container-orga8c62fd" class="outline-2">
<h2 id="orga8c62fd">Installation</h2>
<div class="outline-text-2" id="text-orga8c62fd">
<p>
Pgf/Tikz is a built-in package in the <a href="http://tug.org">texlive</a>. As long as texlive is ready, pgf/tikz is out-of-the-box.
</p>
</div>
</div>
<div id="outline-container-org7b613cc" class="outline-2">
<h2 id="org7b613cc">Usage</h2>
<div class="outline-text-2" id="text-org7b613cc">
</div>
<div id="outline-container-orgb33a64a" class="outline-3">
<h3 id="orgb33a64a">Setting</h3>
<div class="outline-text-3" id="text-orgb33a64a">
<div class="org-src-container">
<pre class="src src-latex">\usepackage{tikz}
...
\tikz ...
\begin{tikzpicture}
...
\end{tikzpicture}
</pre>
</div>
</div>
</div>
<div id="outline-container-org87cd45a" class="outline-3">
<h3 id="org87cd45a">Style</h3>
<div class="outline-text-3" id="text-org87cd45a">
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle newstylename=[option1=value1, option2=value2, ...]
\tikzstyle existingstylename+=[option1=value1, option2=value2, ...]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaf117cf" class="outline-3">
<h3 id="orgaf117cf">Coordinate</h3>
<div class="outline-text-3" id="text-orgaf117cf">
<ul class="org-ul">
<li><code>(x, y)</code></li>
<li><code>(angle: radius)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org76a9303" class="outline-3">
<h3 id="org76a9303">List</h3>
<div class="outline-text-3" id="text-org76a9303">
<div class="org-src-container">
<pre class="src src-latex">% step length = 1
{a, ..., b}
...
% step length = d
{a, a + d, ..., b}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a5f130" class="outline-3">
<h3 id="org5a5f130">Arrow</h3>
<div class="outline-text-3" id="text-org5a5f130">
<ul class="org-ul">
<li>-</li>
<li>-&gt;</li>
<li>&lt;-</li>
<li>&lt;-&gt;</li>
<li>-&gt;&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0a90dc" class="outline-3">
<h3 id="orgb0a90dc">Draw</h3>
<div class="outline-text-3" id="text-orgb0a90dc">
</div>
<div id="outline-container-org89e9ece" class="outline-4">
<h4 id="org89e9ece">Line</h4>
<div class="outline-text-4" id="text-org89e9ece">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) -- (x2, y2) -- (x3, y3) -- cycle
</pre>
</div>
</div>
</div>
<div id="outline-container-org7117f28" class="outline-4">
<h4 id="org7117f28">Curve</h4>
<div class="outline-text-4" id="text-org7117f28">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) .. controls (x2, y2) and (x3, y3) .. (x4, y4);
\draw (x1, y1) .. controls (x2, y2) .. (x3, y3);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb6f243" class="outline-4">
<h4 id="orgbb6f243">Grid</h4>
<div class="outline-text-4" id="text-orgbb6f243">
<div class="org-src-container">
<pre class="src src-latex">\draw [step=s] (x1, y1) grid (x2, y2);
\draw [xstep=x_s, ystep=y_s] (x1, y1) grid (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc551880" class="outline-4">
<h4 id="orgc551880">Arc</h4>
<div class="outline-text-4" id="text-orgc551880">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) arc (start_angle: end_angle: radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-org38eeb3e" class="outline-4">
<h4 id="org38eeb3e">Rectangle</h4>
<div class="outline-text-4" id="text-org38eeb3e">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) rectangle (x2, y2);
\fill [color] (x1, y1) rectangle (x2, y2);
\filldraw [fill=color1, draw=color2] (x1, y1) rectangle (x2, y2);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) rectangle (x2, y2);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) rectangle (x2, y2);
\clip (x1, y1) rectangle (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-org7124134" class="outline-4">
<h4 id="org7124134">Circle</h4>
<div class="outline-text-4" id="text-org7124134">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) circle (radius);
\fill [color] (x1, y1) circle (radius);
\filldraw [fill=color1, draw=color2] (x1, y1) circle (radius);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) circle (radius);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) circle (radius);
\clip (x1, y1) circle (radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-org5290b11" class="outline-4">
<h4 id="org5290b11">Ellipse</h4>
<div class="outline-text-4" id="text-org5290b11">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) ellipse (x_radius and y_radius);
\fill [color] (x1, y1) ellipse (x_radius and y_radius);
\filldraw [fill=color1, draw=color2] (x1, y1) ellipse (x_radius and y_radius);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) ellipse (x_radius and y_radius);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) ellipse (x_radius and y_radius);
\clip (x1, y1) ellipse (x_radius and y_radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-org3952ee2" class="outline-4">
<h4 id="org3952ee2">Node</h4>
<div class="outline-text-4" id="text-org3952ee2">
<div class="org-src-container">
<pre class="src src-latex">(x0, y0) node [anchor=north/south/east/west, shape=circle/rectangle/ellipse, draw=color1, fill=color2, label=angle:node_label_angle] (node_name) {node_label};
...
\node at (x0, y0) (node_name) {node_label};
</pre>
</div>
</div>
<div id="outline-container-org1031507" class="outline-5">
<h5 id="org1031507">Connecting nodes with</h5>
<div class="outline-text-5" id="text-org1031507">
<ul class="org-ul">
<li>Lines</li>
</ul>
<div class="org-src-container">
<pre class="src src-latex">\draw [arrow] (node_name_A) to (node_name_B);
\draw (node_name_A) edge [arrow, color] (node_name_B);
</pre>
</div>
<ul class="org-ul">
<li>Curves</li>
</ul>
<div class="org-src-container">
<pre class="src src-latex">\draw [arrow] (node_name_A) to [bend left/right=30] (node_name_B);
\draw [arrow] (node_name_A) to [in=30, out=60] (node_name_B);
\draw (node_name_A) edge [arrow, color, in=30, out=60] (node_name_B);
\draw (node_name_A) edge [arrow, color, bend left/right=30] (node_name_B);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org64b5292" class="outline-3">
<h3 id="org64b5292">Refer to nodes outside current picture</h3>
<div class="outline-text-3" id="text-org64b5292">
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle{every picture}+=[remember picture]
...
\tikz[overlay]
\begin{tikzpicture}[overlay]
...
\end{tikzpicture}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a9f2fd" class="outline-3">
<h3 id="org3a9f2fd">Mix tikz command with LaTeX</h3>
<div class="outline-text-3" id="text-org3a9f2fd">
<div class="org-src-container">
<pre class="src src-latex">\tikz [baseline] ...
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
